{
    "pages": {
        "index": {
            "title": "Matthew O'Callaghan",
            "cssFile": "index",
            "description": "First class Computer Science graduate with strong frontend and backend development experience and a passion for UX design.",
            "jsFilename": "index"
        },
        "404": {
            "title": "Page not found | Matthew O'Callaghan",
            "cssFile": "404",
            "jsFilename": "404"
        },
        "experimentalgravity": {
            "title": "Experimental Gravity | Matthew O'Callaghan",
            "cssFile": "work",
            "description": "Experimental Gravity is the unique physics-based puzzle that puts you in control of gravity. Available now on iOS!",
            "jsFilename": "work"
        },
        "cakesbykatie": {
            "title": "Cakes by Katie | Matthew O'Callaghan",
            "cssFile": "work",
            "description": "Cakes by Katie is a local cake maker whose website I design, develop and maintain. This website is Katie's primary source of customer acquistion.",
            "jsFilename": "work"
        },
        "atomicexams": {
            "title": "Atomic Exams | Matthew O'Callaghan",
            "cssFile": "work",
            "description": "I am currently working on a prototype for an exams preparation app. It will use a highly targeted and efficient alternative approach I found success with during my own studies.",
            "jsFilename": "work"
        },
        "rl-analytics": {
            "title": "Rocket League Analytics | Matthew O'Callaghan",
            "cssFile": "work",
            "description": "Rocket League Analytics was my third year university project and provides in-game analytics, match history, and statistics tracking for Rocket League players.",
            "jsFilename": "rl-analytics"
        }        
    },
    "work": [
        {
            "title": "Experimental Gravity",
            "description": "Experimental Gravity is a physics-based puzzle game on iOS that puts the player in control of gravity. What goes up, doesn't have to come down...",
            "image": {
                "src": "images/work/experimental-gravity/experimental-gravity.png",
                "alt": "Experimental Gravity on iPhone and iPad"
            },
            "websiteURL": "https://www.experimentalgravity.com",
            "page": "experimentalgravity",
            "colour": "rgb(202,116,184)",
            "backgroundImage": "images/work/experimental-gravity/background.png",
            "moreDetail": [
                "Gameplay opens with a tutorial explaining that technology has been developed which enables gravity to be controlled and it's the player's job to test it, before walking them through the simple touch/swipe controls. 140 levels follow, each a colourful puzzle in which the player is tasked with hitting a number of targets with 'Orbs' by manipulating gravity. Every level has its own objectives for achieving three stars. The game offers colour blind options and both UK and US English.",
                "I developed Experimental Gravity using Unity and C# and designed the vast majority of the game art myself with Inkscape. Being available on both tablet and mobile, the gameplay and UI can adapt to a range of screen sizes, including for devices with a safe area smaller than their screen. Beta testing was conducted using Apple's TestFlight. On completion of the game, app previews and a trailer (available on its <a href=\"https://www.youtube.com/channel/UCesx4XJR_iaRpPF36geNlRA\" target=\"_blank\">YouTube channel</a>) were created using iMovie, and I developed an accompanying website complete with privacy policy and press kit."
            ],
            "devicons": ["c#", "inkscape", "ios", "html", "css", "js", "gulp", "sass"],
            "evidence": {
                "appPreview": "videos/iPhone11.mp4",
                "websiteScreenshots": [
                    {
                        "src": "images/work/experimental-gravity/experimental-gravity-screenshot.png",
                        "alt": "Screenshot of experimentalgravity.com",
                        "caption": "The website uses images, colours, and animations to match those within the game and includes links to its YouTube channel, privacy policy and press kit"
                    }
                ],
                "trailer": "https://www.youtube.com/embed/oNNLfO8Fqfw"
            }
        },
        {
            "title": "Cakes by Katie",
            "description": "Website for a local cake decorator to display her work and acquire new clients.",
            "image": {
                "src": "images/work/cakesbykatie/cakesbykatie.png",
                "alt": "Cakes by Katie on laptop and mobile"
            },
            "websiteURL": "https://www.cakesbykatie.uk",
            "page": "cakesbykatie",
            "backgroundImage": "images/work/cakesbykatie/cakesbykatie-background.jpg",
            "colour": "#f7cac9",
            "moreDetail": [
                "I design, develop and maintain the website of a local cake decorator who uses the brand name Cakes by Katie. This website is Katie's primary method of acquiring customers and has played a significant role in making a quick success of a young business.",
                "On arriving on the home page, users are greeted by an engaging full screen video to immediately display Katie's talents. The site structure includes a portfolio page, a page for each product and occasion, as well as other informational pages, making the site easy to navigate and maximises the site's search engine performance.",
                "Obviously the primary goal of this website is to gain clients, and we regularly review Google analytics, Google Search Console, and Hotjar data to improve our customer acquistion. The website, which uses modern web image formats and scores well using Lighthouse, ranks well on search engines compared to similar competing businesses."
            ],
            "devicons": ["html", "css", "js", "google"],
            "evidence": {
                "websiteScreenshots": [
                    {
                        "src": "images/work/cakesbykatie/cakesbykatie-screenshot-home.jpg",
                        "alt": "Screenshot of cakesbykatie.co.uk home page",
                        "caption": "The home page starts with a striking video of Katie decorating a cake above the fold, followed by information about her, a preview of her portfolio, a magazine feature, contact information, and testimonials."
                    },
                    {
                        "src": "images/work/cakesbykatie/cakesbykatie-screenshot-wedding-cakes.jpg",
                        "alt": "Screenshot of wedding cakes page on cakesbykatie.co.uk",
                        "caption": "There is a page for each product (celebration cakes, wedding cakes, cupcakes, etc.). Above the fold we have a summary of the service and a rotating carousel of images, followed by design ideas, pricing information, suggestions of other products, and any other relevant content."
                    },
                    {
                        "src": "images/work/cakesbykatie/cakesbykatie-screenshot-birthdays.jpg",
                        "alt": "Screenshot of wedding cakes page on cakesbykatie.co.uk",
                        "caption": "There is a page for each occasion (birthdays, weddings, etc.). This page includes links to each relevant product page, tailored to the occasion."
                    },
                    {
                        "src": "images/work/cakesbykatie/cakesbykatie-screenshot-portfolio.jpg",
                        "alt": "Screenshot of portfolio page on cakesbykatie.co.uk",
                        "caption": "The grid of images on the portfolio page fills the screen width and uses a masonry layout."
                    },
                    {
                        "src": "images/work/cakesbykatie/cakesbykatie-screenshot-portfolio-modal1.jpg",
                        "alt": "Screenshot of the modal which opens when a cake is selected from the portfolio.",
                        "caption": "When a cake is selected from the portfolio, a full screen modal opens which can contain a description, testimonial, videos and further images. This particular example provides more images covering all angles of the cake."
                    },
                    {
                        "src": "images/work/cakesbykatie/cakesbykatie-screenshot-portfolio-modal2.jpg",
                        "alt": "Another screenshot of the modal which opens when a cake is selected from the portfolio, this one including a video.",
                        "caption": "Here is another example of a cake from the portfolio being selected. This one includes a video which autoplays when the modal is opened."
                    }
                ]
            }
        },
        {
            "title": "Atomic Exams",
            "description": "Work-in-progress prototype of an app that will provide highly efficient and targeted preparation for exams.",
            "image": {
                "src": "images/work/atomicexams/device-mockup.png",
                "alt": "Atomic Exams prototype on Mac"
            },
            "websiteURL": "https://www.atomicexams.co.uk",
            "page": "atomicexams",
            "colour": "#35dc39",
            "backgroundImage": "images/work/atomicexams/library-background.jpg",
            "moreDetail": [
                "Imagine an academic examiner asks you three questions on neuroscience. Each requires only a short answer, but they're all very difficult and it would quickly become obvious you know nothing about neuroscience. Now imagine instead the examiner shows you a list of five possible questions, but this time says they'll return next week to ask you three of them at random. Over that week you'd likely find the answers to those five questions - perhaps with Google, AI, or even by asking an expert. By the time the examiner returns, you'd have memorised those five short answers. Your limited understanding of neuroscience doesn't matter - when questioned, you'd deliver fluent, rehearsed responses to whichever three questions get put to you and everyone would think you're an expert.",
                "That's how academic assessment works.",
                "When I was fifteen, my school year group sat our science GCSE a year early. When we did our mock exams, everyone in my biology class was underperforming by about two grades. A friend's mother, who was a teacher, explained to me that she'd been going through the biology course's official specification with him to help. I had no idea what a specification was so she showed me, and I found myself looking at a list of exactly what I needed to know for the exam. In hindsight of course such documents had to exist, but most students never see one, let alone use them.",
                "I was stunned. The wording of the specification mirrored past exam questions and mark schemes, and the scope of content was far smaller than our hefty textbooks implied. I realised that if I had a list of everything I needed to know for the exam, then I effectively had a list of all possible questions. I could simply memorise the answer to each of them.",
                "Two months after that disastrous mock exam, I achieved full marks in the real biology paper.",
                "I would continue to learn over the next three years through GCSEs and A-Levels how deeply flawed academic assessment is. Now that I understood the system, I only ever achieved top marks again.",
                "I have always wanted to create a product that uses these insights to help students raise their grades. My ambition is to create a web and mobile app that rivals textbooks by walking users through each course's official specification, helping them learn only the exact content they need. With many exams containing large amounts of theory that can be memorised with little academic skill, the app would emphasise short, flashcard-style content designed for effective recall.",
                "As a first step towards this product, I've developed a tool to map past questions for a particular exam to the exact parts of its specification. I have selected AQA AS Computer Science Paper 2 for my prototype as it's a course I know well having sat it myself. The tool is built using Next.js and hosted on Vercel, with automatic deployments via GitHub CI/CD integration. Tailwind CSS handles the styling. I used ChatGPT to extract structured JSON from PDF documents including the specification, past papers, and mark schemes.",
                "I have developed a landing page for this product using Astro."
            ],
            "devicons": ["next", "react", "typescript", "html", "css", "tailwind", "vercel", "astro"],
            "evidence": {
                "websiteScreenshots": [
                    {
                        "src": "images/work/atomicexams/screenshot-landing-page.jpg",
                        "alt": "Screenshot of Atomic Exams landing page.",
                        "caption": "Landing page details approach, explains product ambitions and introduces current prototype."
                    },
                    {
                        "src": "images/work/atomicexams/screenshot-papers.jpg",
                        "alt": "Screenshot of \"Past papers\" page in Atomic Exams app.",
                        "caption": "Users can view past paper questions and see which parts of the specification they each examine."
                    },
                    {
                        "src": "images/work/atomicexams/screenshot-specification.jpg",
                        "alt": "Screenshot of \"Specification\" page in Atomic Exams app.",
                        "caption": "The official specification for the course has been broken down into more granular points. Statistics are shown for each point and users can view which past paper questions cover each of them."
                    }
                ]
            }
        },
        {
            "title": "Rocket League Analytics",
            "description": "Comprised of a frontend React app and backend node server, Rocket League Analytics provides in-game analytics, match history, and statistics tracking for Rocket League players. All the player has to do is submit an image of the in-game scoreboard...",
            "image": {
                "src": "images/work/rl-analytics/rl-analytics.png",
                "alt": "Rocket League Analytics on various devices"
            },
            "websiteURL": "http://rocketleagueanalytics.herokuapp.com",
            "page": "rl-analytics",
            "colour": "orange",
            "github": "https://github.com/MatthewOCallaghan/rl-analytics",
            "moreDetail": [
                "When players of the video game Rocket League join a match, they do not know the abilities of their random opponents or teammates.  Furthermore, the game does not record match history or provide statistics tracking.  I decided to address these issues for my final year university project.  Some limited solutions already existed, though these were just for PC players, so I was determined to achieve a solution that console players could use.",
			    "At the start of each Rocket League match they play, users of my app will submit a screenshot of the in-game scoreboard, from which the app will extract player usernames. This unique feature ensures my app remains platform independent and so available to console players. For the ~15% of names which my app misreads, users can manually edit them. Data on those players is scraped from Rocket League statistics website Tracker Network and presented to the user in an easily-consumable fashion to be absorbed whilst playing. Once the match has concluded, the same data is scraped again and the result can be calculated by identifying the differences in each player's MVPs, goals, wins, assists, saves, and shots. This match data is stored in a PostgreSQL database, enabling the app to also provide users with match history and statistics tracking over time.",
			    "The concept of 'sessions' are used within the app such that users can create and view sessions, and new matches are added to a session. Logged in users can control a session from multiple devices, allowing them to take the screenshots on their phone but view the analytics on a larger screen.  Users can also co-host sessions, where any host of a session can edit names and add new matches, which is useful for when playing with friends.  All hosts and viewers of a session see the same analytics which update in real-time.",
                "The React app utilised Redux and React Router, and I opted to include React Bootstrap due to the time contraints of the project. The backend Node.js server used Google Cloud Vision API to identify text from screenshots, JSON Web Tokens for managing sessions, Firebase authentication for user logins, and Knex.js to build database queries. Testing was conducted using Jest."
            ],
            "devicons": ["html", "css", "js", "react", "redux", "node", "express", "bootstrap", "postgres", "heroku", "googleCloud", "firebase"],
            "evidence": {
                "websiteScreenshots": [
                    {
                        "src": "images/work/rl-analytics/screenshot1.png",
                        "alt": "Landing page",
                        "caption": "Landing page"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot2.png",
                        "alt": "Login page",
                        "caption": "Login page"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot3.png",
                        "alt": "Adding a new match to a session",
                        "caption": "Adding a new match to a session"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot4.png",
                        "alt": "In-game analytics",
                        "caption": "In-game analytics"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot5.png",
                        "alt": "Editing a username",
                        "caption": "Editing a username"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot6.png",
                        "alt": "Teammates can be invited to co-host a session",
                        "caption": "Teammates can be invited to co-host a session"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot7.png",
                        "alt": "Match results are calculated once the game has finished",
                        "caption": "Match results are calculated once the game has finished"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot8.png",
                        "alt": "Match history",
                        "caption": "Match history"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot9.png",
                        "alt": "Viewing details of a match in match history",
                        "caption": "Viewing details of a match in match history"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot10.png",
                        "alt": "Statistics tracking",
                        "caption": "Statistics tracking"
                    }
                ]
            }
        }
    ],
    "devicons": {
        "html": {
            "class": "html5-plain",
            "title": "HTML"
        },
        "css": {
            "class": "css3-plain",
            "title": "CSS"
        },
        "js": {
            "class": "javascript-plain",
            "title": "JavaScript"
        },
        "c#": {
            "class": "csharp-plain",
            "title": "C#"
        },
        "java": {
            "class": "java-plain",
            "title": "Java"
        },
        "node": {
            "class": "nodejs-plain",
            "title": "Node.js"
        },
        "react": {
            "class": "react-original",
            "title": "React"
        },
        "express": {
            "class": "express-original",
            "title": "Express"
        },
        "gulp": {
            "class": "gulp-plain",
            "title": "gulp"
        },
        "sass": {
            "class": "sass-original",
            "title": "Sass"
        },
        "jquery": {
            "class": "jquery-plain",
            "title": "jQuery"
        },
        "bootstrap": {
            "class": "bootstrap-plain",
            "title": "Bootstrap"
        },
        "postgres": {
            "class": "postgresql-plain",
            "title": "PostgreSQL"
        },
        "redux": {
            "class": "redux-original",
            "title": "Redux"
        },
        "heroku": {
            "class": "heroku-original",
            "title": "Heroku"
        },
        "haskell": {
            "class": "haskell-plain",
            "title": "Haskell"
        },
        "inkscape": {
            "class": "inkscape-plain",
            "title": "Inkscape"
        },
        "googleCloud": {
            "class": "googlecloud-plain",
            "title": "Google Cloud"
        },
        "firebase": {
            "class": "firebase-plain",
            "title": "Firebase"
        },
        "ios": {
            "class": "apple-original",
            "title": "iOS"
        },
        "aws": {
            "class": "amazonwebservices-plain-wordmark",
            "title": "AWS"
        },
        "angularJs": {
            "class": "angularjs-plain",
            "title": "AngularJS"
        },
        "jest": {
            "class": "jest-plain",
            "title": "Jest"
        },
        "google": {
            "class": "google-plain",
            "title": "Google"
        },
        "typescript": {
            "class": "typescript-plain",
            "title": "TypeScript"
        },
        "next": {
            "class": "nextjs-plain",
            "title": "Next.js"
        },
        "figma": {
            "class": "figma-plain",
            "title": "Figma"
        },
        "tailwind": {
            "class": "tailwindcss-plain",
            "title": "Tailwind CSS"
        },
        "vercel": {
            "class": "vercel-original",
            "title": "Vercel"
        },
        "astro": {
            "class": "astro-plain",
            "title": "Astro"
        }
    }
}