{
    "pages": {
        "index": {
            "title": "Matthew O'Callaghan",
            "cssFile": "index",
            "description": "I'm a recent Computer Science graduate with an interest in web, app, and game development.",
            "jsFilename": "index"
        },
        "404": {
            "title": "Page not found | Matthew O'Callaghan",
            "cssFile": "404",
            "jsFilename": "404"
        },
        "experimentalgravity": {
            "title": "Experimental Gravity | Matthew O'Callaghan",
            "cssFile": "work",
            "description": "Experimental Gravity is the unique physics-based puzzle that puts you in control of gravity. Available now on iOS!",
            "jsFilename": "work"
        },
        "rl-analytics": {
            "title": "Rocket League Analytics | Matthew O'Callaghan",
            "cssFile": "work",
            "description": "Rocket League Analytics was my third year university project and provides in-game analytics, match history, and statistics tracking for Rocket League players.",
            "jsFilename": "rl-analytics"
        },
        "cakesbykatie": {
            "title": "Cakes by Katie | Matthew O'Callaghan",
            "cssFile": "work",
            "description": "Cakes by Katie seeks to showcase the work of an aspiring cake decorator. Katie is always looking to gain clients for new projects so that she can practise her skills.",
            "jsFilename": "work"
        },
        "kop-stop": {
            "title": "Kop Stop | Matthew O'Callaghan",
            "cssFile": "work",
            "description": "A project I first started in July 2015, Kop Stop is an online library of Liverpool Football Club songs and chants.",
            "jsFilename": "work"
        }
    },
    "work": [
        {
            "title": "Experimental Gravity",
            "description": "Experimental Gravity is a physics-based puzzle game on iOS that puts the player in control of gravity. What goes up, doesn't have to come down...",
            "image": {
                "src": "images/work/experimental-gravity/experimental-gravity.png",
                "alt": "Experimental Gravity on iPhone and iPad"
            },
            "websiteURL": "https://www.experimentalgravity.com",
            "page": "experimentalgravity",
            "colour": "rgb(202,116,184)",
            "backgroundImage": "images/work/experimental-gravity/background.png",
            "moreDetail": [
                "Gameplay opens with a tutorial explaining that technology has been developed which enables gravity to be controlled and it's the player's job to test it, before walking them through the simple touch/swipe controls. 140 levels follow, each a colourful puzzle in which the player is tasked with hitting a number of targets with 'Orbs' by manipulating gravity. Every level has its own objectives for achieving three stars. The game offers colour blind options and both UK and US English.",
                "I developed Experimental Gravity using Unity and C# and designed the vast majority of the game art myself with Inkscape. Being available on both tablet and mobile, the gameplay and UI can adapt to a range of screen sizes, including for devices with a safe area smaller than their screen. Beta testing was conducted using Apple's TestFlight. On completion of the game, app previews and a trailer (available on its <a href=\"https://www.youtube.com/channel/UCesx4XJR_iaRpPF36geNlRA\" target=\"_blank\">YouTube channel</a>) were created using iMovie, and I developed an accompanying website complete with privacy policy and press kit."
            ],
            "devicons": ["c#", "inkscape", "ios", "html", "css", "js", "gulp", "sass"],
            "evidence": {
                "appPreview": "videos/iPhone11.mp4",
                "websiteScreenshots": [
                    {
                        "src": "images/work/experimental-gravity/experimental-gravity-screenshot.png",
                        "alt": "Screenshot of experimentalgravity.com",
                        "caption": "The website uses images, colours, and animations to match those within the game and includes links to its YouTube channel, privacy policy and press kit"
                    }
                ],
                "trailer": "https://www.youtube.com/embed/oNNLfO8Fqfw"
            }
        },
        {
            "title": "Rocket League Analytics",
            "description": "Comprised of a frontend React app and backend node server, Rocket League Analytics provides in-game analytics, match history, and statistics tracking for Rocket League players. All the player has to do is submit an image of the in-game scoreboard...",
            "image": {
                "src": "images/work/rl-analytics/rl-analytics.png",
                "alt": "Rocket League Analytics on various devices"
            },
            "websiteURL": "http://rocketleagueanalytics.herokuapp.com",
            "page": "rl-analytics",
            "colour": "orange",
            "github": "https://github.com/MatthewOCallaghan/rl-analytics",
            "moreDetail": [
                "When players of the video game Rocket League join a match, they do not know the abilities of their random opponents or teammates.  Furthermore, the game does not record match history or provide statistics tracking.  I decided to address these issues for my final year university project.  Some limited solutions already existed, though these were just for PC players, so I was determined to achieve a solution that console players could use.",
			    "At the start of each Rocket League match they play, users of my app will submit a screenshot of the in-game scoreboard, from which the app will extract player usernames. This unique feature ensures my app remains platform independent and so available to console players. For the ~15% of names which my app misreads, users can manually edit them. Data on those players is scraped from Rocket League statistics website Tracker Network and presented to the user in an easily-consumable fashion to be absorbed whilst playing. Once the match has concluded, the same data is scraped again and the result can be calculated by identifying the differences in each player's MVPs, goals, wins, assists, saves, and shots. This match data is stored in a PostgreSQL database, enabling the app to also provide users with match history and statistics tracking over time.",
			    "The concept of 'sessions' are used within the app such that users can create and view sessions, and new matches are added to a session. Logged in users can control a session from multiple devices, allowing them to take the screenshots on their phone but view the analytics on a larger screen.  Users can also co-host sessions, where any host of a session can edit names and add new matches, which is useful for when playing with friends.  All hosts and viewers of a session see the same analytics which update in real-time.",
                "The React app utilised Redux and React Router, and I opted to include React Bootstrap due to the time contraints of the project. The backend Node.js server used Google Cloud Vision API to identify text from screenshots, JSON Web Tokens for managing sessions, Firebase authentication for user logins, and Knex.js to build database queries. Testing was conducted using Jest."
            ],
            "devicons": ["html", "css", "js", "react", "redux", "node", "express", "bootstrap", "postgres", "heroku", "googleCloud", "firebase"],
            "evidence": {
                "websiteScreenshots": [
                    {
                        "src": "images/work/rl-analytics/screenshot1.png",
                        "alt": "Landing page",
                        "caption": "Landing page"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot2.png",
                        "alt": "Login page",
                        "caption": "Login page"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot3.png",
                        "alt": "Adding a new match to a session",
                        "caption": "Adding a new match to a session"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot4.png",
                        "alt": "In-game analytics",
                        "caption": "In-game analytics"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot5.png",
                        "alt": "Editing a username",
                        "caption": "Editing a username"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot6.png",
                        "alt": "Teammates can be invited to co-host a session",
                        "caption": "Teammates can be invited to co-host a session"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot7.png",
                        "alt": "Match results are calculated once the game has finished",
                        "caption": "Match results are calculated once the game has finished"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot8.png",
                        "alt": "Match history",
                        "caption": "Match history"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot9.png",
                        "alt": "Viewing details of a match in match history",
                        "caption": "Viewing details of a match in match history"
                    },
                    {
                        "src": "images/work/rl-analytics/screenshot10.png",
                        "alt": "Statistics tracking",
                        "caption": "Statistics tracking"
                    }
                ]
            }
        },
        {
            "title": "Cakes by Katie",
            "description": "Personal website for an aspiring cake decorator to display her work and gain clients for new projects to practise her skills.",
            "image": {
                "src": "images/work/cakesbykatie/cakesbykatie.png",
                "alt": "Cakes by Katie on laptop and mobile"
            },
            "websiteURL": "https://www.cakesbykatie.uk",
            "page": "cakesbykatie",
            "backgroundImage": "images/work/cakesbykatie/cakesbykatie-background.jpg",
            "colour": "rgb(252,142,172)",
            "moreDetail": [
                "Cakes by Katie seeks to showcase the work of an up-and-coming cake artist and appeal to potential clients who would like a high-quality cake at cost price.  This website aims to provide her with a more professional web presence than just her Instagram account as she embarks on her new career.  A light colour scheme and spacious layout creates a feel of elegance and quality, whilst cursive fonts are used to give it a more personal touch."
            ],
            "devicons": ["html", "css", "js", "jquery", "bootstrap"],
            "evidence": {
                "websiteScreenshots": [
                    {
                        "src": "images/work/cakesbykatie/cakesbykatie-screenshot1.jpg",
                        "alt": "Screenshot of cakesbykatie.co.uk",
                        "caption": "cakesbykatie.co.uk is a one page website"
                    },
                    {
                        "src": "images/work/cakesbykatie/cakesbykatie-screenshot2.jpg",
                        "alt": "Screenshot of portfolio modal open on cakesbykatie.co.uk",
                        "caption": "Portfolio images can be clicked for more detail"
                    }
                ]
            }
        },
        {
            "title": "Kop Stop",
            "description": "A project I first started in July 2015, Kop Stop is an online library of Liverpool Football Club songs and chants. In its first three years, the site received multiple updates, the latest of which saw me transform it into a database-driven React app, with users now able to filter and search through the numerous sets of lyrics.",
            "image": {
                "src": "images/work/kop-stop/kop_stop_screenshots_small.png",
                "alt": "Kop Stop on laptop and mobile"
            },
            "websiteURL": "http://www.kopstop.co.uk",
            "page": "kop-stop",
            "backgroundImage": "images/work/kop-stop/kop-stop-background.jpg",
            "colour": "red",
            "github": "https://github.com/MatthewOCallaghan/kop-stop",
            "moreDetail": [
                "Named after the famous stand at Liverpool's stadium Anfield, Kop Stop stores over one hundred songs, each of which has a number of associated tags referencing the players, managers, and clubs they are inspired by.  The lyrics and tags are stored in a PostgreSQL database with the backend being run using Node.js and Express.js.  React allows users to seamlessly search and filter through these songs by their tags.",
			    "Videos of songs where found are also included, and new song submissions to the site are welcomed and displayed."
            ],
            "devicons": ["html", "css", "js", "react", "node", "express", "bootstrap", "postgres", "heroku"],
            "evidence": {
                "websiteScreenshots": [
                    {
                        "src": "images/work/kop-stop/kop-stop-screenshot1.jpg",
                        "alt": "Screenshot of kopstop.co.uk"
                    }
                ]
            }
        }
    ],
    "devicons": {
        "html": {
            "class": "html5-plain",
            "title": "HTML"
        },
        "css": {
            "class": "css3-plain",
            "title": "CSS"
        },
        "js": {
            "class": "javascript-plain",
            "title": "JavaScript"
        },
        "c#": {
            "class": "csharp-plain",
            "title": "C#"
        },
        "java": {
            "class": "java-plain",
            "title": "JavaScript"
        },
        "node": {
            "class": "nodejs-plain",
            "title": "Node.js"
        },
        "react": {
            "class": "react-original",
            "title": "React"
        },
        "express": {
            "class": "express-original",
            "title": "Express"
        },
        "gulp": {
            "class": "gulp-plain",
            "title": "gulp"
        },
        "sass": {
            "class": "sass-original",
            "title": "Sass"
        },
        "jquery": {
            "class": "jquery-plain",
            "title": "jQuery"
        },
        "bootstrap": {
            "class": "bootstrap-plain",
            "title": "Bootstrap"
        },
        "postgres": {
            "class": "postgresql-plain",
            "title": "PostgreSQL"
        },
        "redux": {
            "class": "redux-original",
            "title": "Redux"
        },
        "heroku": {
            "class": "heroku-original",
            "title": "Heroku"
        },
        "haskell": {
            "class": "haskell-plain",
            "title": "Haskell"
        },
        "inkscape": {
            "class": "inkscape-plain",
            "title": "Inkscape"
        },
        "googleCloud": {
            "class": "googlecloud-plain",
            "title": "Google Cloud"
        },
        "firebase": {
            "class": "firebase-plain",
            "title": "Firebase"
        },
        "ios": {
            "class": "apple-original",
            "title": "iOS"
        }
    }
}